IDEA Open Model
BeamDataEc2.WidthOfSupportRight Property
Compatible with IDEA StatiCa v 10.1
 Width of support on the right side
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public double WidthOfSupportRight { get; set; }
Public Property WidthOfSupportRight As Double
	Get
	Set
public:
property double WidthOfSupportRight {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace